**PANDAS**

In [1]:
import pandas as pd

*Data Representation*

Tabular data can have single colum called series or multiple colums called data frame

*Data Types*
strings are called objects
int64- int
float64
category- List of text values
Bools
datetime64
timedelta

SERIES
can be created from arrays or loaded from databases

In [5]:
import numpy as np
import pandas as pd

array1 = np.array(["j", "f", "m", "a", "m", "j", "j", "a", "s", "o", "n", "d"])
series1 = pd.Series(array1)
series1

0     j
1     f
2     m
3     a
4     m
5     j
6     j
7     a
8     s
9     o
10    n
11    d
dtype: object

In [7]:
series1.shape

(12,)

In [9]:
monthList = ["j", "f", "m", "a", "m", "j", "j", "a", "s", "o", "n", "d"]

In [10]:
pd.Series(monthList)

0     j
1     f
2     m
3     a
4     m
5     j
6     j
7     a
8     s
9     o
10    n
11    d
dtype: object

*NAMING THE SERIES*

In [12]:
pd.Series(array1, name = "months")

0     j
1     f
2     m
3     a
4     m
5     j
6     j
7     a
8     s
9     o
10    n
11    d
Name: months, dtype: object

To extract info from the data, can store into a new variable as below

In [13]:
selectMonths = series1[3:7]
selectMonths

3    a
4    m
5    j
6    j
dtype: object

Customizing Index

In [17]:
pd.Series(array1, name = "months", index = ["a", "b", "c","d","e","f","g","h","i","j", "k","l"])

a    j
b    f
c    m
d    a
e    m
f    j
g    j
h    a
i    s
j    o
k    n
l    d
Name: months, dtype: object

**OPERATIONS**

In [18]:
data1 = [1,2,3]
data2 = [2,3,4]
numS1 = pd.Series(data1)
numS2 = pd.Series(data2)
numS1.add(numS2, fill_value = 0)

0    3
1    5
2    7
dtype: int64

In [19]:
numS1.mul(numS2, fill_value = 0)

0     2
1     6
2    12
dtype: int64

In [21]:
numS2.div(numS1, fill_value = 0)

0    2.000000
1    1.500000
2    1.333333
dtype: float64

In [22]:
numS2.sub(numS1, fill_value = 0)

0    1
1    1
2    1
dtype: int64

**DATA FRAMES**

In [25]:
datalist = [["GA", 3], ["F", 2], ["UOE", 3]]
dataframe =  pd.DataFrame(datalist)
dataframe

     0  1
0   GA  3
1    F  2
2  UOE  3

In [26]:
dataframe.columns = ["Course", "Grade Point"]
dataframe

  Course  Grade Point
0     GA            3
1      F            2
2    UOE            3

In [28]:
dataframe["Lecturers"] = ["Aisha", "Bishr", "Hadiza"]
dataframe

  Course  Grade Point Lecturers
0     GA            3     Aisha
1      F            2     Bishr
2    UOE            3    Hadiza

*Can create data frame from dicts too same like lists above*

In [32]:
dataframe = pd.DataFrame(datalist, columns = ["course", "grade"])
dataframe

  course  grade
0     GA      3
1      F      2
2    UOE      3

*INDEXING*

uSES DOT NOTATION OR SINGLE SQUARE BRACKET-EXracts only one comn
If more columns needed, double square bracket used

In [33]:
dataframe.course

0     GA
1      F
2    UOE
Name: course, dtype: object

In [34]:
dataframe["course"]

0     GA
1      F
2    UOE
Name: course, dtype: object

In [35]:
dataframe[["course"]]

  course
0     GA
1      F
2    UOE

In [36]:
dataframe[["course", "grade"]]

  course  grade
0     GA      3
1      F      2
2    UOE      3

**Selecting rows in data frames**

iloc or loc

iloc is position based. using the default index.

loc is label based. using the names of rows and columns

For both, iloc or loc.[row_index, column_index]

In [38]:
dataframe.index = ["1st", "2nd", "3rd"] #renaming index
dataframe

    course  grade
1st     GA      3
2nd      F      2
3rd    UOE      3

In [39]:
dataframe.loc["2nd", "course"]

'F'

In [40]:
dataframe.iloc[1, 0]

'F'

Extracting the first couple of rows

In [42]:
dataframe.loc["1st":"2nd"]

    course  grade
1st     GA      3
2nd      F      2

In [43]:
dataframe.iloc[0:2]

    course  grade
1st     GA      3
2nd      F      2

For 3 or more column data frame

In [48]:
dataframe.iloc[0:2, 1:2]

     grade
1st      3
2nd      2

[rows, columns]----------[:]  empty bracket returns the whole rows or columns

In [49]:
dataframe.loc[:, "grade"]

1st    3
2nd    2
3rd    3
Name: grade, dtype: int64

In [50]:
chimamanda = {"books":["america", "half", "purple", "the thing", "we shuld"], "ratings":[208308, 12345, 5116, 32063, 264882]}

In [51]:
bookTable = pd.DataFrame(chimamanda)
bookTable

       books  ratings
0    america   208308
1       half    12345
2     purple     5116
3  the thing    32063
4   we shuld   264882

In [59]:
bookTable[bookTable.iloc[:, 1] > 200000 ]

      books  ratings
0   america   208308
4  we shuld   264882

In [61]:
bookTable[bookTable.loc[:, "ratings"] >200000]

      books  ratings
0   america   208308
4  we shuld   264882